app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-12-26 21:54:57.705063"], ["id", 1]]
---
  def update
    indv_id
    @school_class.update(school_class_params(:title, :room_number))