app/controllers/students_controller.rb

  def update
    indv_id
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Emily"], ["last_name", "Croft"], ["updated_at", "2016-12-26 21:57:57.018193"], ["id", 4]]